In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['harry','rohan','shlok','shubh'],
    "marks":[33,44,55,22],
    "city":['mumbai','pune','tripura','raigad']
}

In [3]:
df= pd.DataFrame(dict1)

In [4]:
df

    name  marks     city
0  harry     33   mumbai
1  rohan     44     pune
2  shlok     55  tripura
3  shubh     22   raigad

In [7]:
df.to_csv('first.csv')

In [8]:
df.to_csv('first2.csv',index=False)

In [10]:
df.head(2)

    name  marks    city
0  harry     33  mumbai
1  rohan     44    pune

In [11]:
df.tail(3)

    name  marks     city
1  rohan     44     pune
2  shlok     55  tripura
3  shubh     22   raigad

In [12]:
df.describe()

           marks
count   4.000000
mean   38.500000
std    14.200939
min    22.000000
25%    30.250000
50%    38.500000
75%    46.750000
max    55.000000

In [22]:
arr=np.array(([22,33,445,55],[2,44,55,66]np.int8))

SyntaxError: invalid syntax (Temp/ipykernel_18008/3312556433.py, line 1)

In [20]:
arr.dtype

dtype('int8')